
&НаКлиенте
Процедура Выгрузить(Команда)
	
	ТекстСообщения = НСтр("ru = 'Для выгрузки внешней обработки (отчета) в файл рекомендуется установить расширение для веб-клиента 1С:Предприятие.'");
	Обработчик = Новый ОписаниеОповещения("ВыгрузитьВФайлЗавершение", ЭтотОбъект);

	ОбщегоНазначенияКлиент.ПоказатьВопросОбУстановкеРасширенияРаботыСФайлами(Обработчик, ТекстСообщения);
	
КонецПроцедуры

// Обработчик результата работы процедуры ВыгрузитьВФайл.
&НаКлиенте
Процедура ВыгрузитьВФайлЗавершение(Подключено, ПараметрыВыгрузки) Экспорт
	
	ПараметрыВыгрузки.Вставить("Подключено", Подключено);
	
	ДиалогСохраненияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	ДиалогСохраненияФайла.Фильтр = ДополнительныеОтчетыИОбработкиКлиентСервер.ФильтрДиалоговВыбораИСохранения();
	ДиалогСохраненияФайла.ИндексФильтра = ?(ПараметрыВыгрузки.ЭтоОтчет, 1, 2);
	ДиалогСохраненияФайла.МножественныйВыбор = Ложь;
	ДиалогСохраненияФайла.Заголовок = НСтр("ru = 'Укажите каталог'");
	
	Обработчик = Новый ОписаниеОповещения("ВыгрузитьФайлВыборФайла", ЭтотОбъект, ПараметрыВыгрузки);
	ДиалогСохраненияФайла.Показать(Обработчик);
	
КонецПроцедуры

// Обработчик результата работы процедуры ВыгрузитьВФайл.
&НаКлиенте
Процедура ВыгрузитьФайлВыборФайла(ВыбранныеФайлы, ПараметрыВыгрузки) Экспорт
	Перем Адрес;
	
	Если ВыбранныеФайлы <> Неопределено Тогда
		ПолноеИмяФайла = ВыбранныеФайлы[0];
		ПолучаемыеФайлы = Новый Массив;
		
		ПараметрыВыгрузки.Свойство("АдресДанныхОбработки", Адрес);
		
		Для Каждого ВнешОбработки ИЗ ПараметрыВыгрузки.Ссылка Цикл
			Если Не ЗначениеЗаполнено(Адрес) Тогда
				Адрес = ДополнительныеОтчетыИОбработкиВызовСервера.ПоместитьВХранилище(ВнешОбработки.Ссылка, Неопределено);
			КонецЕсли;

			ДополнительныеПараметры = Новый Структура;
			ДополнительныеПараметры.Вставить("ПараметрыВыгрузки", ПараметрыВыгрузки);
			ДополнительныеПараметры.Вставить("Адрес", Адрес);

			Если Не ПараметрыВыгрузки.Подключено Тогда
				ПолучитьФайл(Адрес, ПараметрыВыгрузки.ИмяФайла, Истина);
				Возврат;
			КонецЕсли;

			ПолучаемыеФайлы.Добавить(Новый ОписаниеПередаваемогоФайла(ПолноеИмяФайла, ДополнительныеПараметры.Адрес));
		КонецЦикла;
		
		Обработчик = Новый ОписаниеОповещения("ОбработкаРезультатаНеТребуется", ЭтотОбъект);
		НачатьПолучениеФайлов(Обработчик, ПолучаемыеФайлы, ПолноеИмяФайла, Ложь);
	КонецЕсли;
	
КонецПроцедуры

// Обработчик результата работы процедуры ВыгрузитьВФайл.
&НаКлиенте
Процедура ОбработкаРезультатаНеТребуется(ПолученныеФайлы, ДополнительныеПараметры) Экспорт
	Возврат;
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьВнешинеОбработки(Команда)
	ПолучитьВнешниеОбработки();
КонецПроцедуры

&НаСервере
Процедура ПолучитьВнешниеОбработки()
	
	ТаблицаВнешнихОбработок.Очистить();
	ТаблицаЗначений = ТаблицаВнешнихОбработок.Выгрузить().СкопироватьКолонки();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ДополнительныеОтчетыИОбработки.Ссылка КАК Ссылка,
	|	ДополнительныеОтчетыИОбработки.Версия КАК Версия,
	|	ДополнительныеОтчетыИОбработки.Вид КАК Вид,
	|	ДополнительныеОтчетыИОбработки.Информация КАК Информация,
	|	ДополнительныеОтчетыИОбработки.Комментарий КАК Комментарий,
	|	ДополнительныеОтчетыИОбработки.ИмяФайла КАК ИмяФайла,
	|	ДополнительныеОтчетыИОбработки.Родитель КАК Родитель,
	|	ДополнительныеОтчетыИОбработки.ЭтоГруппа КАК ЭтоГруппа,
	|	ДополнительныеОтчетыИОбработки.Наименование КАК Наименование
	|ИЗ
	|	Справочник.ДополнительныеОтчетыИОбработки КАК ДополнительныеОтчетыИОбработки
	|УПОРЯДОЧИТЬ ПО
	|	ЭтоГруппа УБЫВ,
	|	Наименование
	|ИТОГИ
	|ПО
	|	Вид,
	|	Ссылка ИЕРАРХИЯ";

	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаПоВидуОбработки = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Вид");
	Пока ВыборкаПоВидуОбработки.Следующий() Цикл

		ВыборкаПоИерархии = ВыборкаПоВидуОбработки.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией, "Ссылка");
		ВыбратьЭлементыВИерархии(ВыборкаПоИерархии, ТаблицаЗначений, ВыборкаПоВидуОбработки.Вид);	

	КонецЦикла;
	
	ТаблицаВнешнихОбработок.Загрузить(ТаблицаЗначений);

КонецПроцедуры

Процедура ВыбратьЭлементыВИерархии(ВыборкаСИерархией, ТаблицаЗначений, ПрефиксНаименованияКаталога)
	
	
	Пока ВыборкаСИерархией.Следующий() Цикл
        Если ВыборкаСИерархией.ТипЗаписи()=ТипЗаписиЗапроса.ИтогПоИерархии Тогда
           
            ПрефиксНаименованияКаталога = ПрефиксНаименованияКаталога + "\" + ВыборкаСИерархией.Наименвоание;
            ВыбратьЭлементыВИерархии(ВыборкаСИерархией.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией,"Ссылка"), 
            	ТаблицаЗначений, ПрефиксНаименованияКаталога);
        
        ИначеЕсли ВыборкаСИерархией.ТипЗаписи()=ТипЗаписиЗапроса.ИтогПоГруппировке Тогда
            //Пока пропустим, так как итоги по группировке нас не интересуют.
             ВыбратьЭлементыВИерархии(ВыборкаСИерархией.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией,"Ссылка"), 
             	ТаблицаЗначений, ПрефиксНаименованияКаталога);
        ИначеЕсли ВыборкаСИерархией.ТипЗаписи()=ТипЗаписиЗапроса.ДетальнаяЗапись Тогда
        	НоваяСтрока = ТаблицаЗначений.Добавить();
        	ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаСИерархией);
        	НоваяСтрока.ПрефиксНаименованияКаталога = ПрефиксНаименованияКаталога;		
        КонецЕсли; 
          
	КонецЦикла;
	
КонецПроцедуры
