#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция СведенияОВнешнейОбработке() Экспорт
	
	ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке("3.1.0.0");
    ПараметрыРегистрации.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительнаяОбработка();
	ПараметрыРегистрации.Наименвоание = "Выгрузка внешних обработок и отчетов БСП3";
    ПараметрыРегистрации.Версия = "1.1";
	
    Команда = ПараметрыРегистрации.Команды.Добавить();
    Команда.Представление = НСтр("ru = 'Выгрузка внешних обработок и отчетов БСП3'");
    Команда.Идентификатор = "Выгрузка внешних обработок и отчетов БСП3";
    Команда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы();
    Команда.ПоказыватьОповещение = Истина;
    Возврат ПараметрыРегистрации; 
	
КонецФункции

#КонецЕсли
